In [99]:
import pandas as pd
from pandas import *
from IPython.display import Markdown as md
dataset = pd.read_csv("C:/Users/rain/Desktop/untidy.csv")
dataset.head()

   id    name  phone sex_and_age test number  term 1  term 2  term 3
0   1    Mike    134        m_12      test 1      76      84      87
1   2   Linda    270        f_13      test 1      88      90      73
2   3     Sam    210        m_11      test 1      78      74      80
3   4  Esther    617        f_12      test 1      68      75      74
4   5    Mary    114        f_14      test 1      65      67      64

In [100]:
dataset = pd.read_csv("C:/Users/rain/Desktop/untidy.csv")
#No need to have column that combines sex and age, this should be split into their own columns.
dataset[['Sex','Age']] = dataset.sex_and_age.str.split("_",expand=True)
#Had to rename 'sex and age' to sex_and_age so that the and operator doesn't get confused with the column name.
dataset = dataset.drop('sex_and_age', 1)
dataset

   id    name  phone test number  term 1  term 2  term 3 Sex Age
0   1    Mike    134      test 1      76      84      87   m  12
1   2   Linda    270      test 1      88      90      73   f  13
2   3     Sam    210      test 1      78      74      80   m  11
3   4  Esther    617      test 1      68      75      74   f  12
4   5    Mary    114      test 1      65      67      64   f  14
5   1    Mike    134      test 2      85      80      90   m  12
6   2   Linda    270      test 2      87      82      94   f  13
7   3     Sam    210      test 2      80      87      80   m  11
8   4  Esther    617      test 2      70      75      78   f  12
9   5    Mary    114      test 2      68      70      63   f  14

In [101]:
dataset['Total1_scores'] = dataset['term 1'].sum()
dataset['Total2_scores'] = dataset['term 2'].sum()
dataset['Total3_scores'] = dataset['term 3'].sum()
dataset['Average'] = (dataset['Total1_scores'] / 9)
dataset['Average2'] = (dataset['Total2_scores'] / 9)
dataset['Average3'] = (dataset['Total3_scores'] / 9)
dataset['Average']

0    85.0
1    85.0
2    85.0
3    85.0
4    85.0
5    85.0
6    85.0
7    85.0
8    85.0
9    85.0
Name: Average, dtype: float64

In [102]:
dataset['Average2']

0    87.111111
1    87.111111
2    87.111111
3    87.111111
4    87.111111
5    87.111111
6    87.111111
7    87.111111
8    87.111111
9    87.111111
Name: Average2, dtype: float64

In [103]:
dataset['Average3']

0    87.0
1    87.0
2    87.0
3    87.0
4    87.0
5    87.0
6    87.0
7    87.0
8    87.0
9    87.0
Name: Average3, dtype: float64

In [104]:
dataset['Total1_scores']

0    765
1    765
2    765
3    765
4    765
5    765
6    765
7    765
8    765
9    765
Name: Total1_scores, dtype: int64

In [105]:
dataset['Total2_scores']

0    784
1    784
2    784
3    784
4    784
5    784
6    784
7    784
8    784
9    784
Name: Total2_scores, dtype: int64

In [106]:
dataset['Total3_scores']

0    783
1    783
2    783
3    783
4    783
5    783
6    783
7    783
8    783
9    783
Name: Total3_scores, dtype: int64

In [108]:
md("The averages between term 2 and 3 are pretty much the same, but term 1 has a slightly lower total score compared to these two.")

The averages between term 2 and 3 are pretty much the same, but term 1 has a slightly lower total score compared to these two.